app/views/home/index.html.erb

SELECT "reviewers".* FROM "reviewers" WHERE "reviewers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%= current_reviewer.id %>
<%= Reviewer.find(current_reviewer.id).name %>