app/views/dishes/_dish.html.erb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <%if dish.restaurant_id != nil %>
    RESTAURANT: <%= Restaurant.find(dish.restaurant_id).name %><br>