app/views/dishes/index.html.erb

        AVG_RATING: <%= dish.avg_rating%><br>
        RESTAURANT: <%#= Restaurant.find(dish.restaurant_id).name %><br>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]