app/views/dishes/show.html.erb

SELECT "reports".* FROM "reports"
---
                        <%#POSSO SEGNALARE UNA SOLA VOLTA UN PIATTO%>
                        <% (Report.all).each do |report| %>