app/views/dishes/show.html.erb

                    <%if (@dish.restaurant_id != nil)%>
                    <div id = "restaurant">Ristorante : <%= Restaurant.find(@dish.restaurant_id).name %></div>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]