app/views/dishes/show.html.erb

    LISTA RECENSIONI:
    <% (Review.all).each do |review| %>
---
SELECT "reviews".* FROM "reviews"

  <%#l'if è sbagliato%>
    <% (Review.all).each do |review| %>
---
SELECT "reviews".* FROM "reviews"

                    <%if (@dish.restaurant_id != nil)%>
                    <div id = "restaurant">Ristorante : <%= Restaurant.find(@dish.restaurant_id).name %></div>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? ORDER BY "restaurants"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

                                <div id = "username_">
                                    <%=Reviewer.find(review.reviewer_id).username%>
---
SELECT "reviewers".* FROM "reviewers" WHERE "reviewers"."id" = ? ORDER BY "reviewers"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]