app/views/restaurants/show.html.erb

  <p>
  <% Dish.all.each do |dish| %>
---
SELECT "dishes".* FROM "dishes"