app/controllers/dishes_controller.rb

INSERT INTO "dishes" ("name", "number_of_reviews", "price", "category", "avg_rating", "created_at", "updated_at", "restaurant_id", "ingredients", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save