app/controllers/dishes_controller.rb

INSERT INTO "dishes" ("name", "number_of_reviews", "price", "category", "avg_rating", "imgs", "created_at", "updated_at", "restaurant_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save

UPDATE "dishes" SET "number_of_reviews" = ?, "category" = ?, "avg_rating" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["number_of_reviews", 0], ["category", 3], ["avg_rating", 0.0], ["updated_at", "2022-09-02 10:40:48.220911"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @dish.update(dish_params)

DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 3]]
---
  def destroy
    @dish.destroy

SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_dish
      @dish = Dish.find(params[:id])