app/controllers/restaurants_controller.rb

  def create
    session['userType']='Restaurant'
    @restaurant = Restaurant.new(restaurant_params)
    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("name", "username", "website", "description", "profile_picture", "mail", "password", "telephone_number", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "website" = ?, "description" = ?, "profile_picture" = ?, "telephone_number" = ?, "address" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["website", ""], ["description", ""], ["profile_picture", ""], ["telephone_number", ""], ["address", "test address"], ["updated_at", "2022-10-18 21:10:14.978032"], ["id", 1]]