app/controllers/reviewers_controller.rb

SELECT "reviewers".* FROM "reviewers"
---
  def index
    @reviewers = Reviewer.all

DELETE FROM "reviewers" WHERE "reviewers"."id" = ?  [["id", 2]]
---
  def destroy
    @reviewer.destroy

SELECT "reviewers".* FROM "reviewers" WHERE "reviewers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_reviewer
      @reviewer = Reviewer.find(params[:id])