app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating1", "rating2", "rating3", "description", "imgs", "created_at", "updated_at", "dish_id", "reviewer_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)