app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating1", "rating2", "rating3", "description", "created_at", "updated_at", "dish_id", "reviewer_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"