app/views/reviews/_review.html.erb

            <div id = "names_div">
                <div id = "plate_name">Nome del piatto: <%=Dish.find(review.dish_id).name%>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]


                <div id = "restaurant_name">Presso il ristorante: <%=Restaurant.find(Dish.find(review.dish_id).restaurant_id).name%>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        <%if (review.reviewer_id != nil) && (review.dish_id != nil)%>
            <% username = Reviewer.find(review.reviewer_id).username %>
---
SELECT "reviewers".* FROM "reviewers" WHERE "reviewers"."id" = ? ORDER BY "reviewers"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]