app/views/reviews/show.html.erb

SELECT "reviewers".* FROM "reviewers" WHERE "reviewers"."id" = $1 ORDER BY "reviewers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<% if current_reviewer.id == Reviewer.find(@review.reviewer_id).id %>