app/views/layouts/application.html.erb

SELECT "reviewers".* FROM "reviewers" WHERE "reviewers"."id" = ? ORDER BY "reviewers"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        <meta property="og:type"          content="website" />
        <meta property="og:title"         content="Recensione di <%= Reviewer.find(@review.reviewer_id).username%>" />